olliw42/stm32ll-lib/src/stdstm32-uartd.h
// catch missing defines, compiler will throw error anyhow, but so it is nicer
#if defined UARTD_USE_TX && !defined UARTD_TX_IO
  #error No UARTD TX IO defined!
#endif
#if defined UARTD_USE_RX && !defined UARTD_RX_IO
  #error No UARTD RX IO defined!
#endif
#if !defined UARTD_IO_AF
  #error No UARTD IO AF defined!
#endif


//-------------------------------------------------------
// COMMENT:
// LL_USART_XX and LL_LPUART_XX flags are just redefines of USART_XX flags.
// So, we can use USART_XX here and below.
// This has also the advantage that it works for both USART and LPUART.
//
// Note: LPUART does not appear to have STOPBITS_0_5 and STOPBITS_1_5!!
//
// The LL_USART_xx() and LL_LPUART_xx() functions which only relate to flags or
// registers can be used for both USART and LPUART.
// Below we simply use the LL_USART_xx() functions for both.
// Notably, this appears to be incorrect for the init struct functions, which hence
// need special treatment.

#if defined UARTD_IS_LPUART
#if !(LL_USART_PARITY_NONE == LL_LPUART_PARITY_NONE) || !(LL_USART_PARITY_EVEN == LL_LPUART_PARITY_EVEN) || \
    !(LL_USART_PARITY_ODD == LL_LPUART_PARITY_ODD) || \
    !(LL_USART_STOPBITS_1 == LL_LPUART_STOPBITS_1) || !(LL_USART_STOPBITS_2 == LL_LPUART_STOPBITS_2)
  //#error Missmatch of LL_USART and L_LPUART flags!
#endif
#endif


//-------------------------------------------------------
// Glue macros
//-------------------------------------------------------

#if defined STM32F1
  #define REG_DR        DR
  #define REG_SR        SR
  #define FLAG_SR_RXNE  LL_USART_SR_RXNE
  #define FLAG_SR_ORE   LL_USART_SR_ORE
  #define FLAG_SR_NE    LL_USART_SR_NE
  #define FLAG_SR_FE    LL_USART_SR_FE
  #define FLAG_SR_TXE   LL_USART_SR_TXE
  #define FLAG_SR_TC    LL_USART_SR_TC
  #define FLAG_SR_IDLE  LL_USART_SR_IDLE
#elif defined STM32F3 || defined STM32F7 || defined STM32L4 || defined STM32F0
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#elif defined STM32G4 || defined STM32WL || defined STM32H5
  #define REG_DR        TDR
  #define REG_SR        ISR
  #define FLAG_SR_RXNE  LL_USART_ISR_RXNE_RXFNE
  #define FLAG_SR_ORE   LL_USART_ISR_ORE
  #define FLAG_SR_NE    LL_USART_ISR_NE
  #define FLAG_SR_FE    LL_USART_ISR_FE
  #define FLAG_SR_TXE   LL_USART_ISR_TXE_TXFNF
  #define FLAG_SR_TC    LL_USART_ISR_TC
  #define FLAG_SR_IDLE  LL_USART_ISR_IDLE
#endif

#if defined STM32F3 || defined STM32F7 || defined STM32F0
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NCF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#elif defined STM32G4 || defined STM32L4 || defined STM32WL || defined STM32H5
  #define FLAGS_ICR     (LL_USART_ICR_IDLECF | LL_USART_ICR_ORECF | LL_USART_ICR_NECF | LL_USART_ICR_FECF | LL_USART_ICR_PECF)
#endif


//-------------------------------------------------------
// ISR routine
//-------------------------------------------------------
#if defined UARTD_USE_RX || defined UARTD_USE_TX_ISR

void UARTD_IRQHandler(void)
{
  // Cube HAL for f103rc is also calling this first independent on irqs
  uint16_t usart_sr = LL_USART_ReadReg(UARTD_UARTx, REG_SR); // read USART_SR register

#ifdef UARTD_USE_RX
  if ((usart_sr & FLAG_SR_RXNE) && LL_USART_IsEnabledIT_RXNE(UARTD_UARTx)) {
#ifdef UARTD_USE_RXERRORCOUNT
    if (usart_sr & FLAG_SR_ORE) uartd_errorcnt_rxoverrun++;
    if (usart_sr & FLAG_SR_NE) uartd_errorcnt_rxnoise++;
    if (usart_sr & FLAG_SR_FE) uartd_errorcnt_rxframe++;
#endif
    // Cube LL driver (for f103?) says that reading SR and then writing to DR will clear error flags, so do it after error checks
    uint8_t usart_dr = LL_USART_ReceiveData8(UARTD_UARTx); // read USART_DR register, clears RXNE and RX error flags
#ifdef UARTD_RX_CALLBACK_FULL
    UARTD_RX_CALLBACK_FULL(usart_dr);
#else
    uint16_t next = (uartd_rxwritepos + 1) & UARTD_RXBUFSIZEMASK;
    if (uartd_rxreadpos != next) { // fifo not full
      uartd_rxbuf[next] = usart_dr;
      uartd_rxwritepos = next;
    }
#endif
  }
#if defined STM32F1
  // ORE is enabled along with RXNE, so we need to handle it
  // ORE bit is reset by read to USART_SR followed by read to USART_DR
  if (usart_sr & FLAG_SR_ORE) {
    LL_USART_ReceiveData8(UARTD_UARTx); // read USART_DR register, clears RXNE and RX error flags
  }
#else
  // F3: ORE is enabled along with RXNE, but can be cleared by writing 1 to ICR
  // F7: these are cleared by write 1 to the ICR register, not by a read of DR register!
  LL_USART_WriteReg(UARTD_UARTx, ICR, FLAGS_ICR);
#endif
#endif

#ifdef UARTD_USE_TX_ISR
  if ((usart_sr & FLAG_SR_TXE) && LL_USART_IsEnabledIT_TXE(UARTD_UARTx)) {
    if (uartd_txwritepos != uartd_txreadpos) { // fifo not empty
      uartd_txreadpos = (uartd_txreadpos + 1) & UARTD_TXBUFSIZEMASK;
      LL_USART_TransmitData8(UARTD_UARTx, uartd_txbuf[uartd_txreadpos]); // write to USART_DR register, clears TXE flag, as well as TC
    } else {
      LL_USART_DisableIT_TXE(UARTD_UARTx); // disable interrupt when empty
#ifdef UARTD_TC_CALLBACK
      // ATTENTION: doesn't distinguish between empty fifo and last byte just send!
      LL_USART_ClearFlag_TC(UARTD_UARTx); // enable TC interrupt
      LL_USART_EnableIT_TC(UARTD_UARTx);
#endif
#ifdef UARTD_IDLE_CALLBACK
      LL_USART_ClearFlag_IDLE(UARTD_UARTx); // enable IDLE interrupt
      LL_USART_EnableIT_IDLE(UARTD_UARTx);
#endif
    }
  }

#ifdef UARTD_TC_CALLBACK
  if ((usart_sr & FLAG_SR_TC) && LL_USART_IsEnabledIT_TC(UARTD_UARTx)) {
    LL_USART_DisableIT_TC(UARTD_UARTx);
    LL_USART_ClearFlag_TC(UARTD_UARTx);
    UARTD_TC_CALLBACK();
  }
#endif
#ifdef UARTD_IDLE_CALLBACK
  if ((usart_sr & FLAG_SR_IDLE) && LL_USART_IsEnabledIT_IDLE(UARTD_UARTx)) {
    LL_USART_DisableIT_IDLE(UARTD_UARTx);
    LL_USART_ClearFlag_IDLE(UARTD_UARTx);
    UARTD_IDLE_CALLBACK();
  }
#endif
#endif
}

#endif // defined UARTD_USE_RX || defined UARTD_USE_TX_ISR


//-------------------------------------------------------
// TX routines
//-------------------------------------------------------
#ifdef UARTD_USE_TX

